{
    "errors": {
        "The_email_address_is_already_in_use_by_another_account": "The email address is already in use by another account. Try to login.",
        "The_email_address_is_badly_formatted": "Please provide a valid email address. Ex:}\nxxx@xx.com",
        "INVALID_LOGIN_CREDENTIALS": "Please check your email or password.",
        "invalid_api_key": "The provided API key is invalid.",
        "user_disabled": "The user account has been disabled by an administrator.",
        "user_not_found": "There is no user record corresponding to this identifier.",
        "wrong_password": "The password is invalid for the given email.",
        "email_already_in_use": "The email address is already in use by another account.",
        "invalid_email": "The email address is not valid.",
        "operation_not_allowed": "This operation is not allowed. Contact your administrator.",
        "weak_password": "The password must be at least 6 characters long.",
        "provider_already_linked": "This provider is already linked to the user.",
        "credential_already_in_use": "This credential is already associated with a different user account.",
        "requires_recent_login": "This operation is sensitive and requires recent authentication. Log in again before retrying.",
        "user_mismatch": "The supplied credentials do not correspond to the previously signed in user.",
        "provider_not_found": "No supported provider was found to authenticate the user.",
        "invalid_verification_code": "The verification code is invalid.",
        "invalid_verification_id": "The verification ID is invalid.",
        "captcha_check_failed": "The reCAPTCHA response token provided is either invalid, expired, or already used.",
        "app_not_authorized": "The app is not authorized to use Firebase Authentication with the provided API key.",
        "expired_action_code": "The action code has expired.",
        "invalid_action_code": "The action code is invalid. This can happen if the code is malformed or has already been used.",
        "invalid_continue_uri": "The continue URL provided in the request is invalid.",
        "missing_continue_uri": "A continue URL must be provided in the request.",
        "internal_error": "An internal error has occurred. Please try again later.",
        "invalid_tenant_id": "The Auth instance's tenant ID is invalid.",
        "tenant_id_mismatch": "The provided tenant ID does not match the Auth instance's tenant ID.",
        "unsupported_tenant_operation": "This operation is not supported in a multi-tenant context.",
        "quota_exceeded": "The operation could not be completed due to resource limits. Contact Firebase support for assistance.",
        "tenant_not_found": "No tenant for the given identifier was found.",
        "code_expired": "The SMS code has expired. Please resend the verification code to try again.",
        "user_token_expired": "The user's token has expired, and they must sign in again.",
        "provider_data_not_found": "No user record is found for the given provider ID.",
        "invalid_uid": "The provided UID is not valid.",
        "permission_denied": "The operation was denied due to insufficient permissions.",
        "unauthenticated": "The operation requires authentication.",
        "not_found": "The requested document or resource was not found.",
        "already_exists": "The document or resource already exists and cannot be overwritten.",
        "resource_exhausted": "Quota exceeded or rate limited. Contact Firebase support for assistance.",
        "invalid_argument": "The provided argument is not valid.",
        "deadline_exceeded": "The operation timed out and was not completed.",
        "aborted": "The operation was aborted, typically due to a concurrency issue.",
        "out_of_range": "The provided value is outside the allowed range.",
        "unimplemented": "The operation is not implemented or not supported yet.",
        "internal": "An internal error has occurred. Please try again later.",
        "unavailable": "The service is currently unavailable. Please try again later.",
        "data_loss": "Unrecoverable data loss or corruption.",
        "cancelled": "The operation was cancelled.",
        "unknown": "An unknown error occurred.",
        "account_exists_with_different_credential": "An account already exists with the same email address but different sign-in credentials. Try signing in with a different method or link the existing account to this authentication provider.",
        "invalid_credential": "The supplied credential is invalid or has expired. Please sign in again.",
        "popup_closed_by_user": "The Google Sign-In popup was closed by the user before completing the sign-in process.",
        "popup_blocked": "The browser blocked the Google Sign-In popup. Ensure that popups are not blocked in your browser settings.",
        "invalid_client_id": "The provided Google API client ID is invalid or does not match the configured OAuth 2.0 client IDs.",
        "network_request_failed": "A network error occurred during the Google Sign-In process. Check your internet connection and try again.",
        "no_such_provider": "No authentication provider found for the given ID. Make sure Google Sign-In is enabled in your Firebase project.",
        "token_expired": "The Google Sign-In token has expired. Please sign in again.",
        "user_cancelled": "The user cancelled the Google Sign-In process.",
        "web_storage_unsupported": "Web storage is not supported in the current browser. Ensure that localStorage and sessionStorage are supported.",
        "invalid_user_token": "The user's token is invalid, and they must sign in again.",
        "custom_token_mismatch": "The custom token corresponds to a different audience.",
        "dynamic_link_not_activated": "The provided dynamic link domain is not activated for Firebase Dynamic Links. Activate it in the Firebase console.",
        "dynamic_link_not_match_config": "The provided dynamic link domain does not match the configured domain in the Firebase console.",
        "image_not_found": "Image not found"
    },
    "auth": {
        "email": "Email",
        "password": "Password",
        "validEmailError": "Please write a valid email address\nex: xxx@xxx.com",
        "password_validation_error": "Password must be at least 6 characters long.",
        "or": "or",
        "signin": {
            "signin": "Sign In",
            "forgot_password": "Forgot Password?",
            "dontHaveAnAccount": "Don't have an account?",
            "createOne": " Create one",
            "successfullySignedIn": "Successfully Signed In"
        },
        "signup": {
            "signup": "Sign Up",
            "iAcceptThe": "I accept the",
            "termsAndConditions": "Terms and Conditions",
            "termAndConditionsText": "# NFCBox Terms and Conditions\n\n**Last Updated:** [Date]\n\nWelcome to NFCBox. By downloading, installing, or using the NFCBox mobile application (\"App\"), you agree to be bound by the following terms and conditions (\"Terms\"). Please read these Terms carefully before using our services.\n\n## 1. Acceptance of Terms\n\nBy accessing or using the NFCBox App, you agree to comply with and be bound by these Terms and all applicable laws and regulations. If you do not agree with any part of these Terms, you must not use the App.\n\n## 2. Use of the App\n\nNFCBox is designed to help users manage NFC chips and their associated data. You are responsible for ensuring that your use of the App is in compliance with all applicable laws and regulations.\n\n## 3. Account Registration\n\nTo use some features of NFCBox, you may be required to create an account. You agree to provide accurate and complete information when registering for an account and to keep this information up to date. You are responsible for maintaining the confidentiality of your account credentials and for all activities that occur under your account.\n\n## 4. NFC Chip Functionality\n\nNFCBox allows users to interact with NFC chips for various purposes. You acknowledge that NFCBox is not responsible for the content or security of any data stored on the NFC chips, and you are solely responsible for ensuring that your use of the chips complies with any applicable laws and security requirements.\n\n## 5. Security and Privacy\n\nNFCBox takes security seriously. However, we cannot guarantee that your data is completely secure from unauthorized access. You are responsible for maintaining the security of your devices and NFC chips. NFCBox will not be liable for any loss or damage arising from unauthorized access to your account or data.\n\nFor more information on how we handle your personal data, please refer to our **Privacy Policy**.\n\n## 6. Prohibited Activities\n\nYou agree not to use NFCBox for any illegal or unauthorized purpose, including but not limited to:\n- Tampering with NFC chips you do not own.\n- Using NFCBox in a manner that may damage, disable, or impair the App or its services.\n- Violating any laws or regulations applicable in your jurisdiction.\n\n## 7. Intellectual Property\n\nAll content, features, and functionality (including but not limited to text, graphics, logos, icons, and software) of the NFCBox App are owned by or licensed to NFCBox and are protected by intellectual property laws. You agree not to reproduce, distribute, or otherwise exploit any part of the App without prior written consent from NFCBox.\n\n## 8. Limitation of Liability\n\nNFCBox is provided on an \"as is\" and \"as available\" basis. We make no warranties or guarantees regarding the availability, accuracy, or reliability of the App. NFCBox shall not be liable for any indirect, incidental, or consequential damages arising from your use or inability to use the App.\n\n## 9. Changes to Terms\n\nNFCBox reserves the right to modify these Terms at any time. Any changes will be posted within the App, and your continued use of the App after such modifications constitutes your acceptance of the revised Terms.\n\n## 10. Termination\n\nWe reserve the right to terminate or suspend your account at any time, with or without notice, for violating these Terms or for any other reason at our discretion.\n\n## 11. Governing Law\n\nThese Terms shall be governed by and construed in accordance with the laws of [Your Country/State], without regard to its conflict of law principles.\n\n## 12. Contact Information\n\nIf you have any questions or concerns about these Terms, please contact us at:\n\n**Email:** [Your Contact Email]\n",
            "alreadyHaveAnAccount": "Already have an account? ",
            "here": "here",
            "pleaseAcceptTermsConditions": "Please accept the terms and conditions.",
            "createYourAccount": "Create your account"
        },
        "forgotPassword": {
            "forgotPassword": "Forgot Password",
            "sendEmail": "Send Email",
            "validEmailError": "Please write a valid email address",
            "sendResetLink": "Password reset email sent.\nPlease check your email address"
        }
    },
    "home": {}
}